import React from 'react'

const WordBold = ({ word = "Weby" }: { word?: string }) => {
  return <span style={{ fontWeight: "bold" }}>{word}</span>
}

const Page = () => {
  return (
    <section className='about'>
      <h1>אודות</h1>
      <section className='elementWidth'>
        <h2>ברוכים הבאים לאתר של צוות <WordBold />!</h2>
        <p>
          אנחנו <WordBold/>, צוות של מפתחים, מעצבים ומנהלי פרויקטים עם מטרה אחת ברורה - ליצור אתר אינטרנט שמותאם לכם ולעסק שלכם.
          כל אחד מחברי הצוות מביא עמו ניסיון מקצועי עשיר, ידע מעמיק בתחומו ותשוקה לחדשנות. יחד, אנחנו שואפים להעניק ללקוחותינו את ה<WordBold word={"שירות הטוב ביותר"}/>, 
          תוך שמירה על <WordBold word={"איכות"}/> בלתי מתפשרת ו<WordBold word={"עמידה בלוחות הזמנים"}/>.
        </p>
        <p>
          <WordBold word={"החזון שלנו"}/> הוא לפתח ולבנות אתרים מותאמים אישית שמדברים את השפה שלכם ומשקפים את הייחודיות והצרכים של העסק שלכם. 
          אנחנו מאמינים שלכל עסק, קטן וגדול, מגיע אתר שמייצג אותו בצורה המדויקת ביותר, כזה שמצליח לבלוט ולהעביר את המסר בצורה אותנטית ומרשימה. 
          אתרים הם לא רק חלון ראווה דיגיטלי, אלא כלי מרכזי ליצירת קשר עם לקוחות ולהשגת יעדים עסקיים.
        </p>
        <p>
          ב - <WordBold/>, אנחנו מתמקדים בחוויית משתמש יוצאת דופן ומותאמת אישית.
          צוות הפיתוח והמעצבים שלנו עובד יד ביד עם הלקוחות, החל משלב הרעיון ועד להשקה והמשך התחזוקה. אנחנו <WordBold word={"מקשיבים"}/> לצרכים ולרעיונות שלכם, <WordBold word={"מייעצים"}/> ומפתחים פתרונות מדויקים <WordBold word={"שמתאימים"}/> בדיוק לעסק שלכם.
          כל אתר שאנחנו יוצרים מעוצב בקפידה רבה כדי לשקף את המותג והחזון שלכם בצורה המיוחדת ביותר, תוך שילוב טכנולוגיות מתקדמות וממשקים ידידותיים למשתמש.
        </p>
        <p>
          האתר הושק? יופי! אבל אנחנו <WordBold word={"לא עוצרים"}/> שם.
          לאחר שהאתר עולה לאוויר, אנחנו <WordBold word={"ממשיכים"}/> להיות כאן עבורכם עם <WordBold word={"ליווי"}/> ותמיכה רציפים.
          כך, תוכלו להיות בטוחים שהאתר שלכם פועל בצורה מושלמת, מתעדכן ומתפתח יחד עם העסק שלכם.
          עם Weby, אתם לא לבד - אנחנו כאן כדי לוודא שהנוכחות הדיגיטלית שלכם תהיה חזקה, מקצועית ומצליחה.
        </p>
      </section>
    </section>
  )
}

export default Page